<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" 
  "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">  
<!--http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd-->  
<html xml:lang="fr" xmlns="http://www.w3.org/1999/xhtml"  
> 
<head><title>Avant-propos</title> 
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" /> 
<meta name="generator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)" /> 
<meta name="originator" content="TeX4ht (http://www.cse.ohio-state.edu/~gurari/TeX4ht/)" /> 
<!-- xhtml,3,jsmath,html --> 
<meta name="src" content="cours.tex" /> 
<meta name="date" content="2011-06-22 23:09:00" /> 
<link rel="stylesheet" type="text/css" href="cours.css" /> 
<script type="text/x-mathjax-config">
   MathJax.Hub.Config({
    extensions: ["jsMath2jax.js"]
  });
</script>
<script
  src="http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS_HTML">
</script>
 </head><body 
 class="tex2math_ignore" >
   <noscript>  
<div style="color:#CC0000; text-align:center">  
<b>Warning: <a href="http://www.math.union.edu/locate/jsMath">jsMath</a>  
requires JavaScript to process the mathematics on this page.<br />  
If your browser supports JavaScript, be sure it is enabled.</b>  
</div>  
<hr />  
</noscript> 

   <!--l. 2--><div class="crosslinks"><p class="noindent">[<a 
href="coursli1.html" >next</a>] [<a 
href="#tailcoursch1.html">tail</a>] [<a 
href="cours.html#coursch1.html" >up</a>] </p></div>
   <h2 class="chapterHead"><a 
 id="x2-1000"></a>Avant-propos</h2>

                                                                         <div class="flushright" 
>
<!--l. 3--><p class="noindent" >
 <span 
class="cmti-10">Pour Roger Godement et Edmond Ramis, mes ma</span><span 
class="cmti-10">&#x00EE;</span><span 
class="cmti-10">tres</span></p></div>
<!--l. 8--><p class="noindent" >Publier un cours de math&#x00E9;matiques aujourd&#x2019;hui peut sembler une gageure. Apr&#x00E8;s avoir
longtemps recul&#x00E9; devant ce d&#x00E9;fi, j&#x2019;ai profit&#x00E9; des r&#x00E9;cents changements de programme en
classes pr&#x00E9;paratoires pour remettre mes notes au propre. Je n&#x2019;ai pu r&#x00E9;sister alors
&#x00E0; l&#x2019;envie de mettre ce travail &#x00E0; la disposition de la communaut&#x00E9; enseignante et
&#x00E9;tudiante.
</p>
   <div class="paragraphTOCS">
   </div>
<!--l. 13--><p class="noindent" ><span class="paragraphHead"><a 
 id="x2-2000"></a><span 
class="cmbx-10">Le contenu</span></span>
   Ce cours est volontairement concis. Mon objectif est d&#x2019;offrir au lecteur, en un seul volume,
la totalit&#x00E9; (et m&#x00EA;me plus) de ce que l&#x2019;on peut enseigner en un an &#x00E0; un bon &#x00E9;tudiant de
classes pr&#x00E9;paratoires ou de premier cycle universitaire. Il ne s&#x2019;agit aucunement d&#x2019;un ouvrage
destin&#x00E9; &#x00E0; l&#x2019;auto-apprentissage des math&#x00E9;matiques et le lecteur n&#x2019;y trouvera aucun exercice
et tr&#x00E8;s peu d&#x2019;exemples d&#x00E9;velopp&#x00E9;s. Par contre toutes les d&#x00E9;finitions et tous les r&#x00E9;sultats
du cours y figurent, avec presque toujours des d&#x00E9;monstrations compl&#x00E8;tes. Il s&#x2019;agit donc
d&#x2019;un ouvrage qui peut servir d&#x2019;instrument de r&#x00E9;vision et de r&#x00E9;f&#x00E9;rence tout au
long de l&#x2019;ann&#x00E9;e. L&#x2019;&#x00E9;tudiant s&#x2019;y reportera pour retrouver sous une autre forme
l&#x2019;enseignement magistral qu&#x2019;il a d&#x00E9;j&#x00E0; suivi, pour approfondir cet enseignement par des
compl&#x00E9;ments qui font souvent l&#x2019;objet de questions &#x00E0; l&#x2019;&#x00E9;crit ou &#x00E0; l&#x2019;oral, ou pour
effectuer des r&#x00E9;visions rapides avant les contr&#x00F4;les, examens et concours. Il ne manque
pas, chez tous les &#x00E9;diteurs, de livres d&#x2019;exercices et de probl&#x00E8;mes pour permettre
au lecteur de mettre en oeuvre toute sa sagacit&#x00E9; et ses capacit&#x00E9;s de recherche
et pour compl&#x00E9;ter, par des exemples et des applications, les r&#x00E9;sultats expos&#x00E9;s
ici.
</p>
<!--l. 27--><p class="noindent" ><span class="paragraphHead"><a 
 id="x2-3000"></a><span 
class="cmbx-10">Pour quel enseignement</span><span class="frenchb-thinspace">&nbsp;</span><span 
class="cmbx-10">?</span></span>
   Nous avons voulu faire un cours de math&#x00E9;matiques, pas un cours de Math&#x00E9;matiques
Sp&#x00E9;ciales. Pour cette raison, nous n&#x2019;avons pas suivi &#x00E0; la lettre le programme des
classes MP. Nous voulions d&#x2019;une part que cet ouvrage soit facilement utilisable par
les &#x00E9;tudiants de premier cycle universitaire ou par les candidats au CAPES et &#x00E0;
l&#x2019;Agr&#x00E9;gation<span class="frenchb-thinspace">&nbsp;</span>; d&#x2019;autre part il est un proverbe bien connu dans le syst&#x00E8;me &#x00E9;ducatif<span class="frenchb-thinspace">&#x00A0;</span>: <span 
class="cmti-10">les</span>
<span 
class="cmti-10">programmes passent, les math</span><span 
class="cmti-10">&#x00E9;</span><span 
class="cmti-10">matiques (resp. les sciences physiques, les sciences</span>
<span 
class="cmti-10">industrielles, le fran</span>\c{<span 
class="cmti-10">c</span>}<span 
class="cmti-10">ais, la philosophie, etc.) restent</span>. C&#x2019;est pourquoi, sur des sujets
trait&#x00E9;s de mani&#x00E8;re un peu originale &#x00E0; ce niveau dans le programme actuel de <span 
class="cmti-10">taupe</span>,
comme l&#x2019;int&#x00E9;gration, nous avons trait&#x00E9; deux points de vue, aussi bien celui des
fonctions int&#x00E9;grables que celui des int&#x00E9;grales impropres, au prix bien entendu
de certaines redites. De plus, nous avons volontairement inclus un certain nombre
de compl&#x00E9;ments de cours qui sont donc hors de tout programme, soit pour leur
int&#x00E9;r&#x00EA;t math&#x00E9;matique propre et leur beaut&#x00E9; intrins&#x00E8;que (r&#x00E9;duction de Jordan,
topologie g&#x00E9;n&#x00E9;rale, convexit&#x00E9; dans les espaces vectoriels norm&#x00E9;s, applications du

th&#x00E9;or&#x00E8;me de Baire), soit parce qu&#x2019;ils exposent des techniques un peu <span 
class="cmti-10">vieillottes</span>
mais qui font toujours la joie des examinateurs de concours (enveloppes, trajectoires
orthogonales, podaires, etc.). Nous esp&#x00E9;rons que les puristes des programmes nous
pardonneront.
</p>
<!--l. 46--><p class="noindent" ><span class="paragraphHead"><a 
 id="x2-4000"></a><span 
class="cmbx-10">Remerciements</span></span>
   Je voudrais remercier ici tous mes coll&#x00E8;gues du lyc&#x00E9;e Louis le Grand pour
l&#x2019;atmosph&#x00E8;re d&#x2019;amiti&#x00E9; qui r&#x00E8;gne dans la salle des professeurs et pour les longues
discussions qui m&#x2019;ont permis d&#x2019;am&#x00E9;liorer peu &#x00E0; peu le contenu de mon cours<span class="frenchb-thinspace">&nbsp;</span>; de
ce point de vue, ma reconnaissance va tout naturellement &#x00E0; Jacques Chevallet,
Claude Deschamps, Daniel Mollier et Alain Pommellet. Merci &#x00E9;galement &#x00E0; tous
mes &#x00E9;l&#x00E8;ves qui n&#x2019;ont jamais manqu&#x00E9; de souligner avec gentillesse tout passage
un peu faible ou un peu obscur dans mon cours. Mais je voudrais remercier tout
particuli&#x00E8;rement Jacques Chevallet pour l&#x2019;aide qu&#x2019;il m&#x2019;a apport&#x00E9;e en g&#x00E2;chant toute une
partie de ses vacances &#x00E0; relire et &#x00E0; corriger mon <span 
class="cmti-10">manuscrit</span><span class="frenchb-thinspace">&nbsp;</span>; ses corrections judicieuses
ont largement contribu&#x00E9; &#x00E0; am&#x00E9;liorer la r&#x00E9;daction et les d&#x00E9;monstrations sur
bien des points. Je ne voudrais pas terminer sans remercier mon &#x00E9;pouse et mes
enfants pour le soutien moral et l&#x2019;affection dont ils m&#x2019;ont entour&#x00E9; tout au long de ces
ann&#x00E9;es.
</p><!--l. 61--><p class="indent" >   <span 
class="cmr-17x-x-120">Bibliographie</span>
</p><!--l. 1--><p class="noindent" >Marcel Berger, <span 
class="cmti-10">G</span><span 
class="cmti-10">&#x00E9;</span><span 
class="cmti-10">om</span><span 
class="cmti-10">&#x00E9;</span><span 
class="cmti-10">trie</span>, tomes 1 &#x00E0; 5, CEDIC-Nathan, 1977
</p><!--l. 3--><p class="noindent" >Jean Dieudonn&#x00E9;, <span 
class="cmti-10">Calcul infinit</span><span 
class="cmti-10">&#x00E9;</span><span 
class="cmti-10">simal</span>, Hermann, 1968
</p><!--l. 5--><p class="noindent" >Jean Dieudonn&#x00E9;, <span 
class="cmti-10">El</span><span 
class="cmti-10">&#x00E9;</span><span 
class="cmti-10">ments d&#x2019;analyse</span>, tomes 1 et 2, Gauthier-Villars,1969
</p><!--l. 7--><p class="noindent" >Roger Godement, <span 
class="cmti-10">Cours d&#x2019;alg</span><span 
class="cmti-10">&#x00E8;</span><span 
class="cmti-10">bre</span>, Hermann, Paris 1966
</p><!--l. 9--><p class="noindent" >Walter Rudin, <span 
class="cmti-10">Real and Complex Analysis</span>, McGraw-Hill, 1970
</p><!--l. 11--><p class="noindent" >Walter Rudin, <span 
class="cmti-10">Functional Analysis</span>, McGraw-Hill, 1974


</p>
   <!--l. 53--><div class="crosslinks"><p class="noindent">[<a 
href="coursli1.html" >next</a>] [<a 
href="coursch1.html" >front</a>] [<a 
href="cours.html#coursch1.html" >up</a>] </p></div>
<!--l. 53--><p class="indent" >   <a 
 id="tailcoursch1.html"></a>
</p>
    <script type="text/javascript" > 
jsMath.Process(); 
</script> 
    
</body></html> 
